Revit 2027 API
FabricationConfiguration.LoadItemFiles Method
 Loads the specified fabrication item files into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFile> LoadItemFiles(
	IList<FabricationItemFile> itemFiles
)
Public Function LoadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
) As IList(Of FabricationItemFile)
public:
IList<FabricationItemFile^>^ LoadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
member LoadItemFiles :
        itemFiles : IList<FabricationItemFile> -> IList<FabricationItemFile>
Parameters
itemFiles IList<FabricationItemFile>
 The relative paths of the fabrication item files to load.
Return Value
IList<FabricationItemFile>
 The relative paths of the fabrication item files which failed to load.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The current fabrication configuration is not connected and updated to source configuration. Reload and try again. -or- this operation failed.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace